In [ ]:
# https://www.ssa.gov/oact/babynames/limits.html
import pandas as pd

In [ ]:
df = pd.read_csv('yob1880.txt')

In [ ]:
df.head()

In [ ]:
df = pd.read_csv('yob1880.txt', names=['name', 'gender', 'count'])

In [ ]:
df

In [10]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999
name,Mary,Anna,Emma,Elizabeth,Minnie,Margaret,Ida,Alice,Bertha,Sarah,...,Unknown,Vann,Wes,Winston,Wood,Woodie,Worthy,Wright,York,Zachariah
gender,F,F,F,F,F,F,F,F,F,F,...,M,M,M,M,M,M,M,M,M,M
count,7065,2604,2003,1939,1746,1578,1472,1414,1320,1288,...,5,5,5,5,5,5,5,5,5,5

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
name      2000 non-null object
gender    2000 non-null object
count     2000 non-null int64
dtypes: int64(1), object(2)
memory usage: 47.0+ KB

In [ ]:
df.dtypes

In [16]:
df.gender.value_counts()

M    1058
F     942
Name: gender, dtype: int64

In [17]:
df['gender'] = df.gender.astype('category')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
name      2000 non-null object
gender    2000 non-null category
count     2000 non-null int64
dtypes: category(1), int64(1), object(1)
memory usage: 33.4+ KB

In [19]:
df.head()

        name gender  count
0       Mary      F   7065
1       Anna      F   2604
2       Emma      F   2003
3  Elizabeth      F   1939
4     Minnie      F   1746

In [20]:
df.head(10)

        name gender  count
0       Mary      F   7065
1       Anna      F   2604
2       Emma      F   2003
3  Elizabeth      F   1939
4     Minnie      F   1746
5   Margaret      F   1578
6        Ida      F   1472
7      Alice      F   1414
8     Bertha      F   1320
9      Sarah      F   1288

In [21]:
df.tail()

           name gender  count
1995     Woodie      M      5
1996     Worthy      M      5
1997     Wright      M      5
1998       York      M      5
1999  Zachariah      M      5

In [22]:
df.shape

(2000, 3)